#AULA 6 - RESUMO DA AULA ANTERIOR

In [1]:
from datetime import datetime

class Dataprep:
    def __init__(self, df):
        self.df = df
    
    def add_anomes(self):
        agora = datetime.now()
        anomes = agora.strftime('%Y%m')
        self.df["Anomes"] = anomes

In [2]:
import pandas as pd

In [3]:
df = pd.DataFrame({'Nome': ['Joao', 'Maria', 'Pedro'], 'Idade': [35, 37, 41]})

In [4]:
df

    Nome  Idade
0   Joao     35
1  Maria     37
2  Pedro     41

In [5]:
preparacao = Dataprep(df)

In [8]:
preparacao.df

    Nome  Idade  Anomes
0   Joao     35  202308
1  Maria     37  202308
2  Pedro     41  202308

In [7]:
preparacao.add_anomes()